import pygame, random

# Η κλάση κληρονομεί όλες τις ιδιότητες και μεθόδους της κλάσης  "Sprite" που ανήκει στη Pygame.
class Μπάλα(pygame.sprite.Sprite):

    def __init__(self, color, πλάτος, ύψος):
        # καλούμε την __init__ της κλάσης Sprite
        super().__init__()

        # Δημιουργεί ένα καμβά στον οποίο θα ζωγραφίσει ένα παραλληλόγραμμο (ρακέτα)
        self.image = pygame.Surface([πλάτος, ύψος])
        # Καθορίζει το χρώμα του καμβά
        self.image.fill((0, 0, 0))
        # Κάνει το χρώμα του καμβά διαφανές
        self.image.set_colorkey((0, 0, 0))

        # Ζωγραφίζει ένα παραλληλόγραμμο ((μπάλα)) μέσα στον καμβά
        pygame.draw.rect(self.image, color, [0, 0, πλάτος, ύψος])

        # Η οριζόντια και κατακόρυφη συνιστώσα της ταχύτητας αποκτούν τυχαίες αρχικές τιμές
        self.ταχύτητα_x = random.randint(4, 8)
        self.ταχύτητα_y = random.randint(-8, 8)

        # Το παραλληλόγραμμο του καμβά
        self.rect = self.image.get_rect()

    # κάθε φορά που καλείται αυτή η μέθοδος, η μπάλα μετακινείται  μία θέση
    def update(self):
        self.rect.x += self.ταχύτητα_x
        self.rect.y += self.ταχύτητα_y

    def αναπήδηση(self):
        # μετά την αναπήδηση από ρακέτα η οριζόντια συνιστώσα αλλάζει φορά
        self.ταχύτητα_x = -self.ταχύτητα_x
        # Η κατακόρυφη συνιστώσα αποκτά νέα τυχαία τιμή
        self.ταχύτητα_y = random.randint(-8, 8)